#include <stdio.h>

int main()

{

    int a, b, c, x, y;

    int arr[10];


    while (1) {



    b = 10;   // Задаемо машині значення змінних
    a = b;
    x = 0;
    y = 0;

        do { // виконання процесу

        arr[x] = a; // Записуємо в нульовий елемент масива число

        x += 1;    // кожним повторенням елемент масива буде збільшуватися на 1

        c = a + b;  // обчислюватися кожного разу число Фібоначчі

        a = b;   // число записується для обчислення наступного числа Фібоначчі

        b = c;

	} while (a < 800);     // Цикл продовжується доки число Фібоначчі не буде перевищувати 800

    for(;y < 10;y++){  

    printf(" %d", arr[y]);  // Числа в масиві виводяться послідовно з 0 елемента до 9 через пробіл

    }

    return 0;

    }


}
 

